---
type: Marble
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 9
tags: [revit-api, class]
---

# Marble

`Autodesk.Revit.DB.Visual.Marble` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | MarbleColor1 | 2018.1 | `public static string MarbleColor1 { get ; }` |
| Property | MarbleColor2 | 2018.1 | `public static string MarbleColor2 { get ; }` |
| Property | MarbleSize | 2018.1 | `public static string MarbleSize { get ; }` |
| Property | MarbleWidth | 2018.1 | `public static string MarbleWidth { get ; }` |
| Property | TextureAngle | 2018.1 | `public static string TextureAngle { get ; }` |
| Property | TextureLinkTextureTransforms | 2018.1 | `public static string TextureLinkTextureTransforms { get ; }` |
| Property | TextureRealWorldOffsetX | 2018.1 | `public static string TextureRealWorldOffsetX { get ; }` |
| Property | TextureRealWorldOffsetY | 2018.1 | `public static string TextureRealWorldOffsetY { get ; }` |
| Property | TextureRealWorldOffsetZ | 2018.1 | `public static string TextureRealWorldOffsetZ { get ; }` |